; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f7-p14-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 - passenger
             f0 f1 f2 f3 f4 f5 f6 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)

(above f3 f4)
(above f3 f5)
(above f3 f6)

(above f4 f5)
(above f4 f6)

(above f5 f6)



(origin p0 f6)
(destin p0 f2)

(origin p1 f5)
(destin p1 f3)

(origin p2 f3)
(destin p2 f6)

(origin p3 f3)
(destin p3 f4)

(origin p4 f6)
(destin p4 f5)

(origin p5 f4)
(destin p5 f0)

(origin p6 f6)
(destin p6 f0)

(origin p7 f4)
(destin p7 f6)

(origin p8 f6)
(destin p8 f4)

(origin p9 f0)
(destin p9 f1)

(origin p10 f3)
(destin p10 f5)

(origin p11 f4)
(destin p11 f2)

(origin p12 f6)
(destin p12 f2)

(origin p13 f1)
(destin p13 f0)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
))
)

; plan
1. (board f0 p9)
   added: (boarded p9)
   goals met: 0 of 14
2. (up f0 f5)
   deleted: (lift-at f0)
   added: (lift-at f5)
   goals met: 0 of 14
3. (board f5 p1)
   added: (boarded p1)
   goals met: 0 of 14
4. (down f5 f4)
   deleted: (lift-at f5)
   added: (lift-at f4)
   goals met: 0 of 14
5. (board f4 p7)
   added: (boarded p7)
   goals met: 0 of 14
6. (board f4 p11)
   added: (boarded p11)
   goals met: 0 of 14
7. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 0 of 14
8. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 14
9. (board f3 p3)
   added: (boarded p3)
   goals met: 1 of 14
10. (board f3 p2)
   added: (boarded p2)
   goals met: 1 of 14
11. (board f3 p10)
   added: (boarded p10)
   goals met: 1 of 14
12. (down f3 f1)
   deleted: (lift-at f3)
   added: (lift-at f1)
   goals met: 1 of 14
13. (depart f1 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 2 of 14
14. (board f1 p13)
   added: (boarded p13)
   goals met: 2 of 14
15. (up f1 f6)
   deleted: (lift-at f1)
   added: (lift-at f6)
   goals met: 2 of 14
16. (board f6 p0)
   added: (boarded p0)
   goals met: 2 of 14
17. (board f6 p12)
   added: (boarded p12)
   goals met: 2 of 14
18. (board f6 p4)
   added: (boarded p4)
   goals met: 2 of 14
19. (board f6 p6)
   added: (boarded p6)
   goals met: 2 of 14
20. (board f6 p8)
   added: (boarded p8)
   goals met: 2 of 14
21. (depart f6 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 14
22. (depart f6 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 4 of 14
23. (down f6 f2)
   deleted: (lift-at f6)
   added: (lift-at f2)
   goals met: 4 of 14
24. (depart f2 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 5 of 14
25. (depart f2 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 6 of 14
26. (depart f2 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 7 of 14
27. (up f2 f4)
   deleted: (lift-at f2)
   added: (lift-at f4)
   goals met: 7 of 14
28. (board f4 p5)
   added: (boarded p5)
   goals met: 7 of 14
29. (depart f4 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 8 of 14
30. (depart f4 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 9 of 14
31. (down f4 f0)
   deleted: (lift-at f4)
   added: (lift-at f0)
   goals met: 9 of 14
32. (depart f0 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 10 of 14
33. (depart f0 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 11 of 14
34. (depart f0 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 12 of 14
35. (up f0 f5)
   deleted: (lift-at f0)
   added: (lift-at f5)
   goals met: 12 of 14
36. (depart f5 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 13 of 14
37. (depart f5 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 14 of 14
